src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВалютыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/РаботаСКурсамиВалют/Ext/Module.bsl
&НаСервере
 Функция ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере() Экспорт
	 
    Соединение = Новый HTTPСоединение("www.nbrb.by", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);
    Запрос = Новый HTTPЗапрос("/api/exrates/rates?periodicity=0");
    
    Попытка
        Ответ = Соединение.Получить(Запрос);
    Исключение
        ЗаписьЖурналаРегистрации("ЗагрузкаКурсовВалют", УровеньЖурналаРегистрации.Ошибка, , , 
            "Не удалось получить курсы с Нацбанка РБ: " + ОписаниеОшибки());
        Возврат Ложь;
    КонецПопытки;
    
    Если Ответ.КодСостояния <> 200 Тогда
        ЗаписьЖурналаРегистрации("ЗагрузкаКурсовВалют", УровеньЖурналаРегистрации.Ошибка, , , 
            "Нацбанк РБ вернул код: " + Ответ.КодСостояния);
        Возврат Ложь;
    КонецЕсли;
    
    ТекстJSON = Ответ.ПолучитьТелоКакСтроку();
    
    Возврат РазобратьИЗаписатьКурсыJSON(ТекстJSON);
	
КонецФункции

Функция РазобратьИЗаписатьКурсыJSON(ТекстJSON) Экспорт
	
    ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	
	МассивКурсов = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	КоличествоЗагруженно = 0;
	
	Для Каждого ЭлементКурса Из МассивКурсов Цикл
		
		КодВалюты = ЭлементКурса.Cur_Abbreviation;
		Курс = ЭлементКурса.Cur_OfficialRate;
		Кратность = ЭлементКурса.Cur_Scale;
		ДатаКурса = ПреобразоватьВДату(ЭлементКурса.Date);
		
		ЭлементСправочника = НайтиВалютуПоКода(КодВалюты);
		
		Если ЭлементСправочника <> Неопределено И Курс > 0 Тогда
			
			ЗаписатьКурсВРегист(ЭлементСправочника, ДатаКурса, Курс, Кратность);
			КоличествоЗагруженно = КоличествоЗагруженно + 1;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат КоличествоЗагруженно > 0;
	
КонецФункции

Функция ПреобразоватьВДату(Знач ЗначениеДаты)

	Если ТипЗнч(ЗначениеДаты) = Тип("Дата") Тогда
		Возврат ЗначениеДаты;
	КонецЕсли;
	
	СтрокаДаты = Строка(ЗначениеДаты);
    
    Год = Число(Сред(СтрокаДаты, 1, 4));
    Месяц = Число(Сред(СтрокаДаты, 6, 2));
    День = Число(Сред(СтрокаДаты, 9, 2));
    
    Возврат Дата(Год, Месяц, День);

КонецФункции 


функция НайтиВалютуПоКода(КодВалюты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВалютыДенежныхСредств.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВалютыДенежныхСредств КАК ВалютыДенежныхСредств
	|ГДЕ
	|	ВалютыДенежныхСредств.Код = &КодВалюты";
	Запрос.УстановитьПараметр("КодВалюты", КодВалюты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции     

Процедура ЗаписатьКурсВРегист(Валюта, Дата, Курс, Кратность)
	
	НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Валюта.Установить(Валюта);
	НаборЗаписей.Отбор.Период.Установить(НачалоДня(Дата));
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = НачалоДня(Дата);
	НоваяЗапись.Валюта = Валюта;
	НоваяЗапись.Курс = Курс;
	НоваяЗапись.Кратность = Кратность;
	
	НаборЗаписей.Записать();	

КонецПроцедуры
